# Brock Huskisson 
## Week 13 11/19/2020
### Python - Pandas DataFrame - Grouping and Mapping

In [1]:
import numpy as np

from pandas import Series, DataFrame
import pandas as pd

In [2]:
#Mapping
df = DataFrame({'city':['Alma','Brian Head', 'Fox Park', 'Lake Mary'],
               'altitude': [10355, 9800,9062,8966]})

df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [9]:
st_map={'Alma':'Colorado', 'Brian Head':'Utah', 'Fox Park':'Wyoming', 'Lake Mary':'California'}
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [10]:
df['state'] = df['city'].map(st_map)

df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [17]:
#apply 
def meter(x):
    return x / 3.2808

In [18]:
df['altitude'] = df['altitude'].apply(meter)

df

         city   altitude       state
0        Alma  84.168896    Colorado
1  Brian Head  79.657671        Utah
2    Fox Park  73.658961     Wyoming
3   Lake Mary  72.878640  California

In [19]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'),
              index=['UT', 'OH', 'IL', 'OR'])

df

           b         d         e
UT -0.226340  0.865939 -1.723496
OH  1.345958 -1.292827 -0.106158
IL -0.051849 -0.333946  0.075476
OR -0.244332  1.136699 -0.223558

In [20]:
def dif(x):
    return x.max() - x.min()

In [21]:
df.apply(dif)

b    1.590290
d    2.429526
e    1.798972
dtype: float64

In [22]:
df.apply(dif, axis=1)

UT    2.589435
OH    2.638785
IL    0.409422
OR    1.381031
dtype: float64

In [23]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-1.723496  0.0  0.0  1.0
-1.292827  0.0  1.0  0.0
-0.333946  0.0  1.0  0.0
-0.244332  1.0  0.0  0.0
-0.226340  1.0  0.0  0.0
-0.223558  0.0  0.0  1.0
-0.106158  0.0  0.0  1.0
-0.051849  1.0  0.0  0.0
 0.075476  0.0  0.0  1.0
 0.865939  0.0  1.0  0.0
 1.136699  0.0  1.0  0.0
 1.345958  1.0  0.0  0.0

In [25]:
#groupby
df = DataFrame({'k1':['a','a','b','b', 'c'],
               'k2':['one','two','one','two', 'one'],
               'dataset1': np.random.randn(5),
               'dataset2': np.random.randn(5)})

df

  k1   k2  dataset1  dataset2
0  a  one  1.159367  0.913260
1  a  two -0.950533  0.305858
2  b  one -0.608215 -1.371968
3  b  two  0.205914 -0.053225
4  c  one  1.401008  0.246075

In [26]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [27]:
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [28]:
df.groupby(['k1', 'k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [29]:
df['dataset1']

0    1.159367
1   -0.950533
2   -0.608215
3    0.205914
4    1.401008
Name: dataset1, dtype: float64

In [30]:
df

  k1   k2  dataset1  dataset2
0  a  one  1.159367  0.913260
1  a  two -0.950533  0.305858
2  b  one -0.608215 -1.371968
3  b  two  0.205914 -0.053225
4  c  one  1.401008  0.246075

In [34]:
df['dataset1'].groupby(df['k1']).mean()

k1
a    0.104417
b   -0.201151
c    1.401008
Name: dataset1, dtype: float64

In [35]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a   0.104417  0.609559
b  -0.201151 -0.712596
c   1.401008  0.246075

In [36]:
df.groupby(['k1', 'k2']).mean()

        dataset1  dataset2
k1 k2
a  one  1.159367  0.913260
   two -0.950533  0.305858
b  one -0.608215 -1.371968
   two  0.205914 -0.053225
c  one  1.401008  0.246075

In [37]:
group = df.groupby(['k1', 'k2'])[['dataset1']]

group.mean()

        dataset1
k1 k2
a  one  1.159367
   two -0.950533
b  one -0.608215
   two  0.205914
c  one  1.401008